<template>
    <div>
        <navbar />
         <section class="projects">
        <h1 class="heading"> <span>my</span> projects </h1>
        <h3>{{name}}</h3>
        <p>{{detail}}</p>
        <p>{{namemovie}}</p>
        <div class="box-container">
            <iframe width="720" height="405" src="https://www.youtube.com/watch?v=isOGD_7hNIY"
                title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; 
            gyroscope; picture-in-picture" allowfullscreen></iframe>
        </div>
    </section>
    </div>
</template>

<script>
import Navbar from '../components/Navbar.vue'
export default {
  components: { Navbar },
  data() {
      return {
       name: 'Review Movie "Parasite (ชนชั้นปรสิต)"',
       detail: 'เล่าเรื่องราวของครอบครัวตระกูลคิม อาศัยอยู่ใต้ถุนของตึกซอมซ่อ ในย่านชุมชนแออัด มองออกไปนอกหน้าต่างก็เห็นแต่กองขยะ ถึงขนาดที่บางวันมีคนเมามาอ้วกและเยี่ยวใส่  วันหนึ่งเพื่อน คิมกีวู (ชเว วูชิก) จะไปเรียนที่ต่างประเทศจึงขอให้เขาไปติวอังกฤษแทน คิมกีวู จึงแอบสวมรอยเป็นติวเตอร์ให้บ้านมหาเศรษฐีตระกูลปาร์ค จากนั้นเขาเห็นว่างานนี้สามารถสร้างเงินให้กับเขาได้อย่างสบาย เพื่ออยากให้ครอบครัวออกมาจากชีวิตที่เส็งเครง เขาจึงได้วางแผนการ เริ่มจากให้น้องสาว คิมคิจอง (พัคโซดัม) สวมบทบาทเป็นครูสอนศิลปะให้กับลูกชายคนเล็กของบ้านปาร์ค และให้พ่อ คิมกีแท็ก (ซงคังโฮ) มาเป็นคนขับรถให้กับคุณชายตระกูลปาร์ค จากนั้นสองพี่น้องบ้านคิมก็วางแผนใส่ร้ายแม่บ้านคนเก่าให้โดนไล่ออก เพื่อให้ คิมชุงซุค (จัง ฮเยจิน) ผู้เป็นแม่มาสวมรอยสมัครเป็นแม่บ้านคนใหม่ แต่เรื่องราวไม่ได้มีเพียงแค่นั้นเพราะแม่บ้านคนก่อนได้แอบซ่อนความลับบางอย่างไว้ในชั้นใต้ดิน หลังจากที่ไม่ได้ทำงานเป็นแม่บ้านแล้ว แม่บ้านคนก่อนก็ยังหาทางที่จะกลับมาให้ได้เพราะเธอมีบางอย่างที่ซ่อนไว้ในห้องใต้ดิน และแต่เมื่อความลับห้องใต้ดินถูกเปิดเผย ทำให้ชีวิตของครอบครัวคิมเปลี่ยนไปตลอดกาล พร้อมกับทำให้ตระกูลปาร์คพลอยได้รับเรื่องตลกร้ายนี้ไปด้วย',
       namemovie: 'ตัวอย่าง Parasite (ชนชั้นปรสิต)'
       
        }
    }
}    
</script>

<style>

</style>